Repository: dimilkin/CyberDensBlog
Catalog: src/locale/messages.*.xlf
Languages: bg

# profilePictureAlt
source: Dimitar's Profile Picture
bg: Профилна снимка на Димитър

# aboutTitle
source: 👋 Hello, I'm Dimitar
bg: 👋 Здравейте, аз съм Димитър

# healthcareBackground
source: 🏥 {START_TAG_STRONG}Healthcare Background:{CLOSE_TAG_STRONG} I earned my Doctor of Dental Medicine degree in 2016 and practiced in the healthcare field for four years. This experience allowed me to understand the critical role that patient-centricity and quality care play in driving overall patient satisfaction and improving treatment outcomes.
bg: 🏥 {START_TAG_STRONG}Медицински Опит:{CLOSE_TAG_STRONG} Завърших специалност „Доктор по дентална медицина“ през 2016 г. и практикувах в здравеопазването в продължение на четири години. Този опит ми позволи да разбера важната роля, която играят пациентската насоченост и качествената грижа за повишаване на общото удовлетворение на пациентите и подобряване на резултатите от лечението.

# softwareBackground
source: 💻 {START_TAG_STRONG}Software Engineering Background:{CLOSE_TAG_STRONG} In 2020, I pivoted into software development, transforming my long-time hobby into my profession. Since then, I’ve been working as a full-stack developer, while continuing to stay connected with the latest advancements in medical technology.
bg: 💻 {START_TAG_STRONG}Опит в Софтуерното Инженерство:{CLOSE_TAG_STRONG} През 2020 г. се преориентирах към разработката на софтуер, превръщайки дългогодишното си хоби в професия. Оттогава работя като full-stack разработчик, като продължавам да следя последните постижения в медицинските технологии.

# passion
source: ❤️ {START_TAG_STRONG}Passion:{CLOSE_TAG_STRONG} My passion lies at the intersection of healthcare and technology. I am motivated to bridge these worlds by leveraging software to improve healthcare delivery and enhance patient experiences.
bg: ❤️ {START_TAG_STRONG}Страст:{CLOSE_TAG_STRONG}Страстта ми е в пресечната точка на здравеопазването и технологиите. С голям интерес следя как светът става все по-дигитализиран, как това това са случва в здравеопазването и до какви промени води за пациентите, лекарите, фармацията и всички замесени.

# linkedinLink
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Connect on LinkedIn
bg: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Профил в LinkedIn

# emailLink
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Contact via Email
bg: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Свържете се по Имейл

# closingNote
source: 📧 {START_EMPHASISED_TEXT}Thank you for visiting my page. Feel free to reach out for questions, collaborations, or just to say hello!{CLOSE_EMPHASISED_TEXT}
bg: 📧 {START_EMPHASISED_TEXT}Благодаря, че посетихте страницата ми. Не се колебайте да се свържете с мен за въпроси, сътрудничество или просто да кажете „Здравей“!{CLOSE_EMPHASISED_TEXT}

# navHome
source: Home
bg: Начало

# navAbout
source: About
bg: За мен

# navContact
source: Contact
bg: Контакт
