[
    {
        "id": 1,
        "title": "DNA and NHIS",
        "preview": "What are the similarities between biological and computer systems",
        "imageUrl": "https://imagizer.imageshack.com/img923/5682/2V80T8.png",
        "content": [
            {
                "type": "paragraph",
                "text": "The National Health Information System (NHIS) plays the role of a guardian of essential data, similar to DNA. Both systems share numerous similarities in terms of information processing."
            },
            {
                "type": "paragraph",
                "text": "Just as DNA cannot be directly accessed to use the information from it, NHIS also does not provide direct access to end users of the system. For this purpose, both systems use intermediaries that have access only to the necessary information for a specific purpose, following strictly defined rules and mechanisms. In the case of DNA, such an intermediary is messenger RNA (mRNA), whose task is to copy a specific section of DNA and make it possible to read it through a process called transcription."
            },
            {
                "type": "paragraph",
                "text": "In a similar way, when a system reads information from a database, this happens according to certain rules known as \"transactions\". The result of this process is a copy of the requested information, which, however, is not yet ready for immediate use by the biological or computer system. This is followed by the process of translating the information - the so-called translation. In the biological system, this includes the creation of a protein molecule according to the instructions recorded in mRNA. In computer systems (with slight conventions), the process is similar and is called deserialization. The end result is a logically new object that the respective system can use. In the biological context, this is a specific protein with a characteristic structure and function, while in the software system, this is a specific data object that facilitates working with the data."
            },
            {
                "type": "image",
                "url": "https://imagizer.imageshack.com/img922/8585/8yLbVX.png"
            },
            {
                "type": "paragraph",
                "text": "It is important to note that these objects reflect the available information at the moment of copying it. If in the meantime the available information in the DNA or database is changed, this will not be automatically reflected in the newly created objects and they will represent the old data. While such events are exceptional with DNA, they can occur with databases."
            },
            {
                "type": "paragraph",
                "text": "Here lies the major difference between the two systems. DNA itself is a complete set of information that cannot be easily added to or removed - or at least it is not recommended. The available data can be modified, but this happens slowly and with difficulty on random principles. On the other hand, databases are created to collect data. The recording of information is carried out through a complex mechanism to guarantee the integrity, homogeneity, and reliability of the data upon completion of the record. These principles are particularly critical for medical information."
            },
            {
                "type": "image",
                "url": "https://imagizer.imageshack.com/img922/7498/3NyfUm.png"
            },
            {
                "type": "ad",
                "bannerUrl": "ad_banner.jpg",
                "link": "https://example.com/ad-link",
                "description": "Advertisement description"
            },
            {
                "type": "paragraph",
                "text": "For this reason, software developed to work with NHIS must meet a number of requirements when making queries to the central system. Queries are made according to the international standard HL7 FHIR and are accompanied by an electronic signature as a guarantee of authenticity and uniqueness."
            },
            {
                "type": "paragraph",
                "text": "The similarities between biological and computer systems are numerous. It is interesting how, in building the architecture and principles of software operation, people have imitated many of the principles of action of biological systems. We hope in future publications to examine more such principles."
            }
        ],
        "date": "September 17, 2025"
    },
    {
        "id": 2,
        "title": "Digital Health in the EU and NHIS",
        "preview": "Preview text",
        "imageUrl": "https://imagizer.imageshack.com/img922/9263/UW9w69.png",
        "content": [
            {
                "type": "paragraph",
                "text": "European healthcare is undergoing a profound transformation, driven by greater citizen mobility, advances in digital technologies, and the need for consistent evaluation of medical innovations. Recent EU legislative acts — Directive 2011/24/EU, Implementing Decision (EU) 2019/1765, and Regulation (EU) 2021/2282 — build the foundation of this transformation. They form a framework that strengthens patient rights, develops connected digital health systems, and harmonizes the assessment of health technologies. This text examines how these initiatives are shaping the future of healthcare in Europe and what they mean for health professionals and for the National Health Information System (NHIS) in Bulgaria."
            },
            {
                "type": "image",
                "url": "https://imagizer.imageshack.com/img922/7498/3NyfUm.png"
            },
            {
                "type": "paragraph",
                "text": "Patient Rights in Cross-Border Healthcare\nDirective 2011/24/EU guarantees the right of EU citizens to receive health services in another member state and to have their costs reimbursed by their country of origin. Patients can travel for treatment abroad if it is covered by their national health system. Reimbursement of costs is at the same level as for treatment in their own country, but cannot exceed the actual cost of the service. In some cases — such as hospital stays or highly specialized treatment — prior authorization may be required.\nThe directive also defines the responsibilities of the country of origin and the country of treatment. The former is responsible for reimbursing costs and for follow-up care, while the latter must ensure safe and quality health services on equal terms for foreign patients. Beyond individual rights, the document encourages cooperation through European Reference Networks for rare diseases and through digital initiatives, which today are reflected in European health systems such as Bulgaria's NHIS."
            },
            {
                "type": "paragraph",
                "text": "Building the Digital Backbone: The eHealth Network\nImplementing Decision (EU) 2019/1765 establishes the rules for the functioning of the eHealth Network — a voluntary platform for cooperation between national health authorities of EU member states. The goal is to ensure that citizens' medical data can be securely exchanged between individual countries, thus facilitating access to health services throughout the EU.\nThe network's objective is to ensure the integration of electronic health records, to provide conditions for the development of telemedicine, mobile applications, artificial intelligence, and big data analysis in healthcare. Security and protection of personal data are fundamental principles, with strict cybersecurity standards being introduced. The network also proved its importance during the COVID-19 pandemic, when it supported the interoperability of national contact tracing applications.\nBy 2025, all 27 member states are actively participating in this network. For Bulgaria, through NHIS, this means integration into the European digital infrastructure and access to cross-border health data exchange through the National Contact Points for eHealth."
            },
            {
                "type": "paragraph",
                "text": "Regulation on Health Technology Assessment\nRegulation (EU) 2021/2282 introduces an EU-wide framework for Health Technology Assessment (HTA). The goal is for new medicines, medical devices, and therapies to be evaluated in a scientifically sound and coordinated manner throughout the EU. Instead of each country conducting separate analyses, joint clinical assessments will be carried out, especially for new oncology drugs, therapies for rare diseases, and high-risk medical devices. This reduces duplication of effort and accelerates patient access to innovations.\nManufacturers will be able to receive scientific advice at the European level to design clinical trials that meet the needs of HTA bodies. Although pricing decisions remain a national competence, countries will work with a common scientific basis. For Bulgaria, this means that NHIS and related institutions will be able to use these assessments as part of the process of integrating new technologies into the health system."
            },
            {
                "type": "image",
                "url": "https://imagizer.imageshack.com/img922/9977/Xoo5rk.png"
            },
            {
                "type": "paragraph",
                "text": "The Way Forward: Digital Transformation of Health Systems\nThe European Commission emphasizes that digital technologies must be considered an essential part of healthcare. Successful transformation requires solutions that are tailored to both patient needs and the specific characteristics of health systems. Exchange of good practices, investment in integrated infrastructure, and development of digital skills among medical professionals and citizens are necessary.\nIn Bulgaria, through NHIS, these processes are woven into national practice, allowing better access to data, higher quality services, and participation in European networks. NHIS should develop not only as an administrative system, but as a key tool for health data exchange and integration into the European digital health space.\nFor Bulgarian professionals, these legislative acts mean a future in which clinical practice, patient access, and the implementation of innovations will be better coordinated at the European level. Knowledge of these rules is key not only for compliance with requirements, but also for active participation in the transformation of healthcare through NHIS."
            },
            {
                "type": "paragraph",
                "text": "References"
            },
            {
                "type": "paragraph",
                "text": "Directive 2011/24/EU",
                "link": "https://eur-lex.europa.eu/legal-content/BG/TXT/?uri=CELEX%3A32011L0024"
            },
            {
                "type": "paragraph",
                "text": "Implementing Decision (EU) 2019/1765",
                "link": "https://eur-lex.europa.eu/legal-content/BG/TXT/?uri=CELEX%3A32019D1765"
            },
            {
                "type": "paragraph",
                "text": "Regulation (EU) 2021/2282",
                "link": "https://eur-lex.europa.eu/eli/reg/2021/2282/oj"
            },
            {
                "type": "paragraph",
                "text": "National Health Information System (NHIS)",
                "link": "https://his.bg/bg/about"
            }
        ],
        "date": "20.03.2025"
    },
    {
        "id": 3,
        "title": "Don't Automate Care – Automate the Documents.",
        "preview": "Automating processes in a dental clinic brings significant added value.",
        "imageUrl": "https://images.cyberdens.tech/ai_dark_brain.png",
        "content": [
            {
                "type": "paragraph",
                "text": "\"I hear about many interesting innovations and new technologies entering dentistry, but I'm not a technical person.\" You don’t need a technical degree to benefit from automation, innovation, and AI. You just need to understand what’s possible, what’s realistic, and how to get help. Let’s first focus on the area that frees up the most staff hours – automation."
            },
            {
                "type": "image",
                "url": "https://images.cyberdens.tech/flow1.png"
            },
            {
                "type": "paragraph",
                "text": "What does \"automation\" really mean?"
            },
            {
                "type": "paragraph",
                "text": "When I say \"automation,\" I don’t mean replacing staff with robots, learning programming, or buying expensive corporate software. I mean connecting tools you already use and that are free – like Google Calendar, Gmail, Docs, and others – so they can talk to each other. I mean eliminating repetitive manual tasks, like copying information from patient-filled forms into computer documents. I mean creating consistent, reliable processes that run the same way every time – helping ensure predictability and dependability. That’s all – nothing mystical, just logic and connectivity."
            },
            {
                "type": "paragraph",
                "text": "What can and cannot be automated?"
            },
            {
                "type": "paragraph",
                "text": "Good candidates for automation are tasks that happen the same way every time: repetitive data entry, sending routine emails, creating documents from templates, moving information from one place to another, organizing and storing information. In dental practice, this means things like turning registration form data into a patient file, automatic emails after appointments, requests for feedback and reviews, appointment reminders, and messages about upcoming checkups."
            },
            {
                "type": "paragraph",
                "text": "Poor candidates for automation are anything requiring judgment or empathy: handling unique patient situations, complex decision-making, building patient relationships, clinical assessments, handling complaints. The rule is simple: if the task requires human judgment or compassion, leave it human. If it’s mechanical and repetitive – automate it. Never automate patient care, only document-related work."
            },
            {
                "type": "image",
                "url": "https://images.cyberdens.tech/dental-reception2.png"
            },
            {
                "type": "paragraph",
                "text": "Actual costs and investment?"
            },
            {
                "type": "paragraph",
                "text": "Let’s talk numbers. For software, you can use Google products – Sheets, Forms, Docs, Calendar, etc. You can also use other open-source automation tools for signing and various functionalities. Google products cost 0 BGN/month. Open-source software monthly fees are also 0 BGN/month."
            },
            {
                "type": "paragraph",
                "text": "For initial setup, you have two options. You can hire someone to set it up, or do it yourself. In one case, you pay someone for the service; in the other, the cost is your time. Ongoing maintenance is minimal – about one to two hours per quarter for updating templates, software updates, or automation adjustments when new requirements appear."
            },
            {
                "type": "paragraph",
                "text": "If automation saves 3–4 hours per week per staff member at 15–20 BGN per hour, you save 2,500–4,000 BGN annually just in labor. Plus added value for patients and a system that can provide data for analyzing business processes."
            },
            {
                "type": "paragraph",
                "text": "What does the process actually look like?"
            },
            {
                "type": "paragraph",
                "text": "Building it usually takes a day or two, depending on the complexity of the process. Then it’s thoroughly tested. Next, staff are trained – how to work with the new tools, what to expect, and what to watch for. Finally, the automation is launched in a live environment and its performance is monitored."
            },
            {
                "type": "paragraph",
                "text": "Should you do it yourself or hire help?"
            },
            {
                "type": "paragraph",
                "text": "This decision depends entirely on your situation. You can always do it yourself. If you’re interested in new technologies and can dedicate free time to building these processes – this is a valid option. If your goal is a fast result and business needs, aiming for best practices, require it to work perfectly from day one, and don’t have free time – hire a consultant. A good consultant makes you independent, not dependent."
            }
        ],
        "date": "05.01.2026"
    }    
]